function tf(){
    let Tc = 23;
    let Tf;

    Tf = (9 / 5) * Tc + 32;

    alert(Tf);
}

function second(){
    let admin;
    let name="Василий";

    console.log(admin=name)
}


console.log(10 + 10 + "10"); //2010 - конкатенация происходит после сложения цифр 10+10, так как в контексте есть строка 
console.log(10 + "10" + 10); //101010 - здесь полностью конкатенация 
console.log(10 + 10 + +"10"); /* здесь сначала обычная сумма 10+10 первых двух чисел, затем из за знака + перед строкой она 
становится числом поэтому 20+10=30*/
console.log(10 / -"");/*пустое значение это ноль по анологии предыдущего описания в данном случае
 знаменатель становится нулевым числом с отрицательным знаком и следовательно результат бесконечность(-Infinity)*/
console.log(10 / +"2,5");/*NaN, полагаю результат связан с тем что в качестве десятичного разделителя используется запятая, что в js
 воспринимается как последовательность чего либо, а это не число)*/